import 'package:flutter/material.dart';

import '../widgets/details_widget.dart';

class DetailsDr3ya extends StatelessWidget {
  const DetailsDr3ya({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.white,
      body: Content(
        data: Data(
          title: "مدينة الدرعية",
          image: ['assets/yanbu.jpg', 'assets/img.png'],
          description: [ '',  'قصة "النخلة المباركة" في الدرعية\n\nفي الزمن القديم، عندما كانت الدرعية قرية صغيرة تحيط بها الواحات والنخيل، عاش شيخ حكيم يُدعى "سعدون". كان سعدون معروفاً بحكمته وحبه لأهل قريته. وفي أحد الأيام، وبينما كان يتفقد بساتين النخيل، وجد نخلة صغيرة بدأت تنمو في مكان غير معتاد، وسط أرض قاحلة بعيداً عن مجرى الماء.\n\nرأى سعدون في ذلك علامة غريبة وقرر أن يعتني بالنخلة بنفسه. بدأ ينقل الماء إليها يومياً من البئر، رغم أنها كانت بعيدة عن قريته. استمر على هذا الحال لسنوات، وأصبحت النخلة شجرة باسقة تُعطي أفضل أنواع التمر في الدرعية.\n\nذات ليلة، رأى سعدون في حلمه رجلاً نورانياً يخبره أن النخلة هذه ليست كأي نخلة، بل هي رمز للخير والازدهار. وقال له الرجل:\n"كما غذّيتها بالماء والعمل الصادق، ستُغذي الدرعية بالقوة والوحدة، وستصبح هذه الأرض مركزاً للمجد والعز."\n\nبعد هذا الحلم، أخبر سعدون أهل الدرعية بالقصة، وأصبحت النخلة رمزاً للقرية. وفي السنوات التي تلت، بدأت الدرعية تزدهر وتتحول إلى مركز تجاري وسياسي مهم في نجد.\n\nيُقال إن هذه النخلة كانت شاهدة على أولى خطوات تأسيس الدولة السعودية، وظلّت رمزاً للصمود والعمل الدؤوب، يرويها الأجداد جيلاً بعد جيل كجزء من تاريخ الدرعية العريق.',

            '','','',''],
        ),
        maxLines: 3,
      ),
    );
  }
}