import 'package:flutter/material.dart';

import '../widgets/details_widget.dart';


class DetailsYnb extends StatelessWidget {
  const DetailsYnb({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.white,
      body: Content(
        data: Data(
          title: "مدينة ينبع",
          image: ['assets/yanbu.jpg','assets/img.png'],
          description: [
            'تقع مدينة ينبع على الساحل الغربي للمملكة العربية السعودية، بمحاذاة البحر الأحمر، وهي واحدة من أقدم المدن التاريخية في المملكة. كانت ينبع تُعرف تاريخياً بأنها محطة تجارية هامة على طريق البخور والتوابل، حيث كانت تربط بين الشرق والغرب.',
            'قصة "الفتاة والصياد" في ينبع\n\nفي قديم الزمان، كانت ينبع مدينة صغيرة يعمّها الهدوء، يعيش أهلها على صيد الأسماك والتجارة. وفي إحدى القرى القريبة من الميناء، كانت هناك فتاة تُدعى "نورة"، مشهورة بجمالها وذكائها. لكنها كانت تُعرف أيضاً بسرّ غريب: كانت تتحدث إلى البحر كل صباح عند شروق الشمس، وتبقى هناك لساعات وكأنها تنتظر شيئاً.\n\nذات يوم، أثناء عودة الصياد "سعيد" من البحر، لاحظ نورة وهي جالسة على الشاطئ، ترسم في الرمال وتتحدث بصوت خافت. اقترب منها وسألها عن سبب حديثها مع البحر. ابتسمت نورة وقالت:\n"البحر يحمل أسراراً عميقة، وأنا أبحث عن رسالة من أبي، الذي اختفى في أعماقه منذ سنوات."\n\nكان والد نورة قد فقد أثناء رحلة صيد عاصفة، لكنها لم تفقد الأمل في عودته. تأثر سعيد بقصتها، وقرر مساعدتها. في كل مرة يذهب للصيد، كان يبحث في الأعماق عن أي دليل قد يقود إلى والدها.\n\nبعد أشهر من البحث، عاد سعيد وفي يده صندوق صغير مغلق بإحكام. عندما فتحته نورة، وجدت بداخله رسالة من والدها. كانت الرسالة تخبرها بأنه عاشق للبحر ولن يعود، ولكنه سيبقى حياً في الأمواج التي تراها كل يوم.\n\nمنذ ذلك اليوم، أصبحت نورة تنظر للبحر بحب وسكينة، وعاشت حياتها ممتنة للرسائل التي تحملها الأمواج. أما سعيد، فقد أصبح الصديق الأقرب لنورة، يشاركها قصص البحر وأسراره.\n\nيُقال إن هذه القصة تحولت إلى رمز في ينبع، تُذكّر الناس برباطهم الوثيق بالبحر وأسراره التي لا تنتهي.',
            '', '', '', '', '',
          ],
        ),
        maxLines: 3,
      ),
    );
  }
}
