import 'package:flutter/material.dart';

import '../widgets/details_widget.dart';

class DetailsOla extends StatelessWidget {
  const DetailsOla({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.white,
      body: Content(
        data: Data(
          title: "مدينة العلا",
          image: ['assets/yanbu.jpg', 'assets/img.png'],
          description: [ '',  'سرّ الكتابة على الصخور\n\nفي قديم الزمان، عُرفت العلا بأنها مركز للتجارة والثقافة، وكانت القبائل تتواصل فيما بينها باستخدام النقوش والرموز على الصخور. لكن، هناك قصة تُحكى عن نقشٍ غامض ظهر فجأة على أحد الجبال القريبة من المدينة.\n\nيُقال إن تاجراً يُدعى "شريف" كان يعبر العلا قادماً من الجنوب محملاً بالبضائع الثمينة. وبينما كان يسير عبر الوادي، ضل طريقه بسبب عاصفة رملية. لجأ إلى كهف صغير ليحتمي من العاصفة، وهناك، وجد نقشاً غريباً على الجدار يحمل رسالة مشفرة تقول:\n"اتبع ظلال الجبال وقت الغروب لتجد الماء والحياة."\n\nشعر شريف بالحيرة ولكنه قرر أن يصدق الرسالة. في اليوم التالي، تبع ظلال الجبال عند الغروب حتى وصل إلى واحة خضراء غنية بالماء، لم تكن معروفة لأحد. بفضل تلك الواحة، استعاد شريف قوته وأكمل رحلته. وعندما عاد إلى العلا، روى قصته، وأصبح النقش معروفاً بين الناس بأنه هدية من الآلهة القديمة لإنقاذ الأرواح.\n\nبعدها بسنوات، حاول الباحثون فك شفرة النقش ولكنهم لم يتمكنوا من معرفة كاتبه، مما جعله أسطورة حيّة في ذاكرة أهل العلا.',
            '',
            '',
            '',
            '',
            ''],
        ),
        maxLines: 3,
      ),
    );
  }
}